/**
 * 我想要完成的一些事情，有时候会忘记
 * 
 * indexDB的使用
 * 原生的websocket的使用体验
 * 个人博客代码逻辑和页面的优化和重写
 * 毕业设计的消息的问题，全局消息
 * 解决https的通讯问题
 * 设计模式的重新复习
 * 数据结构的那本书再看一下-----看一下每一种数据结构在实际中的一些的具体的应用
 * 
 * 做一下两个系统之间的通信几秒钟不回复重新发送三次验证的
 * 
 * 数据库的E-R模型图的练习画法
 * 
 * 不可以给任何dom节点添加任何自定义属性？ 闭包如何解决？
 * 实现内存泄露的几种方式？
 * 左侧目录的一些练习/复习
 * 
 * 获取dom元素的动态和静态获取方法的使用。
 * 
 * 兼容ie8以上的样式和问题的总结
 * 加深一下学习node使用谷歌浏览器 -- 和查看变量内存的一些东西。
 */

急需完成的任务

// 简历的制作
// Hexo博客的搭建

// 完成webpack的基础知识的了解、
// TypeScript的知识练习一下
// Vue、React的前端知识看一下
// 自己的笔记
// 看一些面试题

// 工作中的内容
// koa的源码
