/*
  从2019-8-24起，每天记录下来自己的学习日志 和 工作的日志
  完成的一些工作，和学习/复习的一些内容
*/

/**
 * 我想要完成的一些事情，有时候会忘记
 * 
 * indexDB的使用
 * 原生的websocket的使用体验
 * 个人博客代码逻辑和页面的优化和重写
 * 毕业设计的消息的问题，全局消息
 * 解决https的通讯问题
 * 设计模式的重新复习
 * 数据结构的那本书再看一下-----看一下每一种数据结构在实际中的一些的具体的应用
 * 
 * 做一下两个系统之间的通信几秒钟不回复重新发送三次验证的
 * 
 * 数据库的E-R模型图的练习画法
 * 
 * 不可以给任何dom节点添加任何自定义属性？ 闭包如何解决？
 * 实现内存泄露的几种方式？
 * 左侧目录的一些练习/复习
 * 
 * 获取dom元素的动态和静态获取方法的使用。
 * 
 * 兼容ie8以上的样式和问题的总结
 * 加深一下学习node使用谷歌浏览器 -- 和查看变量内存的一些东西。
 */


// 8-24 学习了一些js实现栈、以及一些栈的应用
// 8-25 重写了一下个人博客的登录注册接口、学习了队列以及一些应用
// 8-26 兼容了支付宝和微信小程序的授权方式 练习了队列
// 8-27 看了一些关于链表的资料
// 8-28 整理了栈、队列、链表的笔记到github，并练习链表的使用

// 8-31 优化了个人博客的个人中心、修复了github上文件太大的问题
// 9-1 修复了工作中支付宝扫描普通链接二维码的工作
